eup/app/views/robot_states/_form.html.erb

    <%= f.label :robot %><br />
    <%= select("robot", "robot_id", Robot.all.collect { |r| [r.name, r.id]}, {:include_blank => 'None'}) %>
---
SELECT "robots".* FROM "robots"