eup/app/controllers/home_controller.rb

  def search
    @q = params[:q]
    @robot = Robot.find(session[:robot])

    @places = []
    if not @q.nil?
      wildcard = '%' + @q + '%'
      @places = Place.find(:all, :conditions => ["name LIKE ? or tags LIKE ?", wildcard, wildcard])
---
SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", 3]]
SELECT "places".* FROM "places" WHERE (name LIKE '%office%' or tags LIKE '%office%')