eup/app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT "places".* FROM "places"

  def show
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "locx", "locy", "name", "tags", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @place = Place.find(params[:id])
    @place.destroy
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "places" WHERE "places"."id" = ?  [["id", 980190962]]

  def navigate
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]