eup/app/controllers/robot_states_controller.rb

  def index
    @robot_states = RobotState.all
---
SELECT "robot_states".* FROM "robot_states"

  def show
    @robot_state = RobotState.find(params[:id])
---
SELECT "robot_states".* FROM "robot_states" WHERE "robot_states"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @robot_state = RobotState.new(params[:robot_state])

    respond_to do |format|
      if @robot_state.save
---
INSERT INTO "robot_states" ("activity", "created_at", "robots_id", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["activity", "Fetching yogurt"], ["created_at", Sat, 15 Sep 2012 01:15:29 UTC +00:00], ["robots_id", nil], ["updated_at", Sat, 15 Sep 2012 01:15:29 UTC +00:00], ["user", "tlau"]]