eup/app/controllers/robots_controller.rb

SELECT "robots".* FROM "robots"
---
  def index
    @robots = Robot.all

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @robot = Robot.find(params[:id])

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @robot = Robot.find(params[:id])

INSERT INTO "robots" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "locx", "locy", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @robot = Robot.new(params[:robot])

    respond_to do |format|
      if @robot.save

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @robot = Robot.find(params[:id])

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "robots" WHERE "robots"."id" = ?  [["id", 980190962]]
---
  def destroy
    @robot = Robot.find(params[:id])
    @robot.destroy

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "3"]]
---
  def claim
    @robot = Robot.find(params[:id])